Tekla Open API Reference for Tekla Structures 2025
Boolean Properties
The Boolean type exposes the following members.
Properties
Name | Description
Value
 Gets or sets the boolean value.
Top
See Also
Reference
Boolean Structure
Tekla.Structures.Datatype Namespace